{
	"newb_mission": true,
	"mission_title": "A Backup a Day",
	"mission_desc": "...keeps disasters away. A couple of your company's computer systems need maintenance, and you drew the short straw.",
	"tasks": [],
	"success": { "hacker_cred": 0, "cash": 0, "desc": ""},
	"failure": { "hacker_cred": 0, "cash": 0, "desc": ""}
},
{
	"newb_mission": true,
	"mission_title": "Gutenberg Groupie"
	"mission_desc": "Your local library is in a financial pinch. You decide to help out by running a puzzle-based scavenger hunt: a public awareness stunt and a fundraiser all in one."
	"tasks": [
		{
			"skill": "cryptanalysis",
			"mod": -2,
			"alt": {
				"skill": "connections",
				"mod": 0
			},
			"desc": "Design a fun puzzle-not too easy and not too hard. Or, find an enigmatographer.",
		},
		{
			"skill": "social_engineering",
			"mod": 0,
			"alt": null,
			"desc": "Get volunteers to help as event staff. Beg, threaten, or bribe with cookies."
		]
	"success": { "hacker_cred": 0, "entropy_card": 1, "desc": "Draw an Entropy Card."}
	"failure": { "hacker_cred": 0, roll hardware_hacking (fail=-$6K},"The scavenger hunt was a total flop. Make a hardware_hacking foll to fix the library's broken computers. If you fail, donate $6K to the library."}
},
{
	"newb_mission": true,
	"mission_title": "Love is in the Air",
	"mission_desc": "You're demonstrating Wi-Fi security risks to an auditorium of 500 students as part of Online Awareness Week.",
	"tasks": [
		{
			"skill": "network_ninja",
			"mod": -3,
			"alt": null,
			"desc": "Download free software that intercepts Wi-Fi network traffic, then displays the images that nearby people are browsing. Live demos are jinxed, so triple check everything."
		}
	]
	"success": { "hacker_cred": 1, "desc": "The students got the point. But next time, verfy that all students are 18+ before the demo."}
	"failure": { "hacker_cred": 1, "desc": ""}
},
{
	"newb_mission": true,
	"mission_title": "9 6 31 25 26 27 28 6 1 7 13",
	"mission_desc": "Your nephew needs help with his math homework. Help him solve these cryptograms. NOTE: Solving these cryptograms is optional. Groovy, but optional.",
	"tasks": [
		{
			"skill": "cryptanalysis",
			"mod": 0,
			"desc": "2 14 12 12 27 , 23 27 6 12 16 - 16 15 16 31 27 21 14 18 25 14 9 26 13 27 7 14 26 2 15 20 28 14 12 13 14?"
		},
		{
			"skill": "cryptanalysis",
			"mod": -1,
			"desc": "23 2 1 26 ' 13 31 27 21 6 9 6 31 25 26 27 30 21 ? 16 15 14 31 27 21 20 27 26 15 9 14 26 2 1 26 26 2 15 13 23 1 13 14 20 9 6 31 25 26 14 16 23 15 26 2 6 13 1?"
		}
	]
	"success": { "hacker_cred": 0, "desc": "No reward. You were expected to succeed."},
	"failure": { "hacker_cred": 1, "desc": ""}
},
{
	"newb_mission": true,
	"mission_title": "Order in the Court",
	"mission_desc": "Your client believes that one of its fired employees leaked intellectual property as revenge. Testify as an expert witness."
	"tasks": [
		{
			"skill": "social_engineering",
			"mod": 2,
			"desc": "Explain how the ex-employee talked his way into the building after his ID badge was revoked."
		},
		{
			"skill": "network_ninja",
			"mod": 1,
			"desc": "Demonstrate the network monitoring software that he installed to extract confidential documents."
		}
	],
	"success": { "hacker_cred": 0, "cash": 1000, "desc": "Earn $1K as a professional consulting fee."}
	"failure": { "hacker_cred": 1(all players},"Your company's reputation is damaged. All players -1 Hacker Cred."}
},
{
	"newb_mission": true,
	"mission_title": "Knock Knock",
	"mission_desc": "Who's there? The FBI comes knocking on your door with evidence suggesting that you were trying to break into a military network.",
	"tasks": [
		{
			"skill": "network_ninja"
			"mod": 0,
			"desc": "Someone must have been using your wireless network for illegal activities. Go through the logs and show that some other computer was on your network during the time of the attack."
		}
	],
	"success": { "hacker_cred": 0, "entropy_card": 1, "desc": "Someone else was on your network, hacking military systems and...streaming infomercials? Draw an Entropy Card."},
	"failure": { "hacker_cred": 2, "desc": "This misunderstanding will take a long time to clear up. -2 Hacker Cred."}
}
{ 
	"newb_mission": false,
	"mission_title": "Disinformation Debacle",
	"mission_desc": "A national news web site was hacked and a fake news article was posted about the decline of a fortune 500 company. As a result, that company's stock plummeted. Find the culprits.",
	"tasks": [
		{
			"skill": "software_wizardry",
			"mod": -2
			"desc": "Can you figure out (and fix} the software vulnerability the attackers used to first gain entry to the system?"
		},
		{
			"skill": "forensics",
			"mod": 0,
			"desc": "Analyze the network logs to find the attacker"
		}
	]
	"success": { "hacker_cred": 2, "desc": "The culprit is arrested. +2 Hacker Cred."},
	"failure": { "hacker_cred": 1, "cash": 3000, "desc": "Turns out you had stock in the company. Double Bummer. Lose $3K."}
}
{
	"newb_mission": false,
	"mission_title": "I Can Haz Sweater",
	"mission_desc": "The machines at Holiday Snuggles, Inc., have suddenly started to knit Internet memes into sweaters. Management turns to you in their hour of need.",
	"tasks": [
		{
			"skill": "network_ninja",
			"mod": -3,
			"desc": "You suspect foul play. Use your network savvy to reconstruct the most likely avenue of attack."
		}
	]
	"success": { "hacker_cred": 1, "cash": 2000, "desc": "You receive one of the "limited edition" meme sweaters-now a collectible! +1 Hacker Cred and get $2K."},
	"failure": { "hacker_cred": 1, "desc": "-1 Hacker Cred"}
},
{
	"newb_mission": false,
	"mission_title": "Seen, Not Heard",
	"mission_desc": "What better way to spend the afternoon than trying to hack your neighbour's entertainment system?",
	"tasks": [
		{
			"skill": "hardware_hacking",
			"mod": 0,
			"desc": "Conveniently, you have the same entertainmennt system. Take it apart and figure out how the proprietary wireless protocol works."
		},
		{
			"skill": "network_ninja",
			"mod": 0,
			"desc": "Make sure that next time she has a movie night, her speakers get \"accidentally\" muted."
		}
	],
	"success": { "hacker_cred": 1, "desc": "Payback for when she hacked your sprinklers during a croquet game. The friendly rivalry continues. +1 Hacker Cred."},
	"failure": { "hacker_cred": 1, "desc": "-1 Hacker Cred"}
}
{
	"newb_mission": false,
	"mission_title": "Hay Baby, Hay Baby, Hay",
	"mission_desc": "You've been hired to audit the security of StableMarriage.com, an online dating site for equestrians.",
	"tasks": [
		{
			"skill": "social_engineering",
			"mod": -1,
			"desc": "\"What's your favourite color?\" \"What's your horse's breed?\" \"What kind of car do you drive?\" Turns out that many of the site's recovery questions ask for answers easily found on user's dating profiles."
		},
		{
			"skill": "search_fu",
			"mod": 0,
			"desc": "Find the remaining answers on other social networks and in government databases."
		}
	]
	"success": { "hacker_cred": 1, "desc": "+1 Hacker Cred and draw an Entropy Card."},
	"failure": { "hacker_cred": 1, "desc": "-1 Hacker Cred"}
}

/*11*/
{
	"newb_mission": false,
	"mission_title": "If You Can't Beat Them..."
	"mission_desc": "Sometimes it's easiest to strike at the root. Your target: the cyber-crime underground."
	"tasks": [{ "skill": "social_engineering","mod": 00,"Skulk around the dark corners of the web until you get an invitation to a chatroom brokering illegal botnet services."},{ "skill": "social_engineering",-1,"Get invited to an exclusive party hosted by the botnets' creators. Learn what the botmmasters plan to do next"}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}

/*12*/
{
	"newb_mission": false,
	"mission_title": "Tech or Treat?"
	"mission_desc": "Halloween is fast approaching, and your haunted houses are the stuff of legends."
	"tasks": [{ "skill":"software_wizardry","mod": 00,"Robotic bat, check. LED-o'-lantern, check. Eerie soundtrack, check. Now choreograph the action with custom software."},{ "skill": "cryptanalysis","mod": 00,"Will anyone notice the secret message blinking from your pumpkin?"},{ "skill": "social_engineering","mod": 00,"After all the high-tech risks, no one was expecting that you'd be hiding inside the "stuffed" scarecrow."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred and draw an Entropy Card."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}

/*13*/
{
	"newb_mission": false,
	"mission_title": "Playing with Trains"
	"mission_desc": "Suspicious activity has been logged at the local train depot."
	"tasks": [{ "skill": "forensics","mod": 00,"Looks like someone's been trying to chat up every computer on the network. That's a bit too promiscuous to be legit."},{ "skill":"software_wizardry","mod": 00,"You find a vulnerability that would let someone bypass the login process and control the train switches over the internet. Patch that bug!"}]
	"success": { "hacker_cred": 1,"The attacker didn't get lucky... but it's still good that the company has now decided to practice safe networking! +1 Hacker Cred."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}

/*14*/
{
	"newb_mission": false,
	"mission_title": "Inside Job"
	"mission_desc": "An electronics superstore thinks that an employee is stealing photos and financial records from computers brought in for repair. The company hires you to figure out who it is."
	"tasks": [{ "skill": "social_engineering",-1,"Pose as an employee. Don't forget to help the customers!"},{ "skill": "social_engineering",-2,"Chat up and shadow the other employees until you find the culprit."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}

/*15*/
{
	"newb_mission": false,
	"mission_title": "You Walk Among Them"
	"mission_desc": "Men in black suits hire you for an audit. The target? Files on a password-protected computer...behind a locked door...in an unlisted facility...in Roswell, New Mexico."
	"tasks": [{ "skill": "lockpicking","mod": 00,"How quickly can you pick that lock? The security guard is almost done with her round."},{ "skill": "cryptanalysis","mod": 00,"Maybe the password's "1947,""password1," or "changeme"? Or is it written on a sticky note attached to the monitor?"}]
	"success": { "hacker_cred": 1, entropy_card+1, "+1 Hacker Cred and draw an Entropy Card."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}

/*16*/
{
	"newb_mission": false,
	"mission_title": "A Healthy Dose of Security"
	"mission_desc": "Is that an insulin pump in your pocket, or are you just happy to see me? A medical technology company hires you to consult on their security team."
	"tasks": [{ "skill": "network_ninja","mod": 00,"Make sure that the insulin pump only accepts wireless commands from its paired controller."},{ "skill": "forensics","mod": 00,"Log enough data so that attempted attacks can be reconstructed."},{ "skill": "hardware_hacking","mod": 00,"Design hardware failsafes to help make sure that the pump won't administer dangerous doses of insulin."}]
	"success": { "hacker_cred": 1, +$3K, "+1 Hacker Cred and get a $3K bonus."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred. The company definitely won't be asking you back to help secure their pacemakers."}
}

/*17*/
{
	"newb_mission": false,
	"mission_title": "Crash Test Dummy"
	"mission_desc": "The wheel sensor’s connected to the.. engine computer; the engine computer’s connected to the .. brake computer.  The modern automobile is completely drive-by-wire."
	"tasks": [{ "skill": "cryptanalysis","mod": 0,"You can plug into the car’s internal computer network, but need to bypass the authentication scheme before you can get anywhere"}, { "skill": "hardware_hacking", +1, "Hack the engine"}, { "skill": "hardware_hacking", "mod": -1, .. and the brakes}, (connections,"mod": 0, "Get access to a race track for some road testing"}]
	"success": { "hacker_cred": 1, mission_card+1, "+1 Hacker Cred. Next round, draw an extra Mission card; you may take both to the Staff Video Conference before you decide which to play(and discard the other}"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}




/*18*/
{
	"newb_mission": false,
	"mission_title": "Fortune Cookie Fun"
	"mission_desc": "It’s almost April Fool’s Day, and you want to play a memorable gag on your friend."
	"tasks": [{ "skill": "hardware_hacking","mod": 0,"Make a Wi-Fi hardware doodad that plugs in between her computer and her keyboard"}, { "skill": "network_ninja", "mod": -1, "Configure it to insert "helpful" phrases at your wireless whim(Don’t log what she types! She’d kill you."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred…in bed"}
	"failure": { "hacker_cred": 1, bag_of_tricks-1 (in play}, "-1 Hacker Cred. Discard one Bag of Tricks card that is in play on your board."}
}



/*19*/
{
	"newb_mission": false,
	"mission_title": "Getting Lucky"
	"mission_desc": "You’ve landed in Las Vegas for a job(it’s good to be you}: a taxi company is trying to decide between two in-cab payment systems."
	"tasks": [{ "skill":"software_wizardry", "mod": -1,"You uncover several critical security flaws with the wireless transmission protocols."}, { "skill": "hardware_hacking", "mod": 0, "A demo is worth a thousand words. Make a handheld unit that will intercept credit card numbers as they are processed."]
	"success": { "hacker_cred": 1, (play} bag_of_tricks=1 (hand/discard}, "+1 Hacker Cred. Also, a good evening at the tables! Choose on bag of Tricks card for your hand or the discards; you can play the item free of charge."}
	"failure": { "hacker_cred": 1, entropy_card-2, "-1 Hacker Cred. Discard two Entropy cards form your hand."}
}


/*20*/
{
	"newb_mission": false,
	"mission_title": "Baby, You Can Fly My Plane"
	"mission_desc": "The U.S. government asked you to improve the security systems for their unmanned aerial vehicles(UAVs}."
	"tasks": [{ "skill":"software_wizardry","mod": 0,"Don’t let enemy troops view the live video stream."}, { "skill":"software_wizardry",-1, "Prevent unauthorised personnel from accessing flight or weapons controls."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred."}
	"failure": { "hacker_cred": 1, (1 turn}software_wizardry-2, "As the icing on the cake, you fell down the stair and broke your arm. -2 on all software_wizardry rolls during your next turn(keep this card until then as a reminder}. -1 Hacker Cred."}
}

/*21*/
{
	"newb_mission": false,
	"mission_title": "Cookie-Blocked"
	"mission_desc": "All your browsing history are belong to us. Targeted advertising may help keep internet services free, but sometimes you want to keep different parts of your life (and web browsing} separate."
	"tasks": [{ "skill": "network_ninja", "mod": -2,"Browse cookies, Flash cookies, local storage, ETags… catalog all the ways that advertisers keep tabs on your online behaviour."}, { "skill":"software_wizardry", "mod": -1, "Write a web browser extension that circumvents tracking mechanisms. Now you can finally look at movie reviews without being overwhelmed by computer hardware ads."}]
	"success": { "hacker_cred": 1/entropy_card+2,"Your choice: +1 Hacker Cred or draw two Entropy cards."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*22*/
{
	"newb_mission": false,
	"mission_title": "Front Door Waltz"
	"mission_desc": "You’re auditing DataBox - providers of ultra-secure, ultra private web storage."
	"tasks": [(barista,"mod": 0,"Make two coffees - one for each hand"}, { "skill": "social_engineering","mod": 0, "Thanks for getting that access - controlled door for me when my hands are so full."}, { "skill": "network_ninja", "mod": 0, "You plug into the internal network - something they never expected! Firewall bypassed. Game over."}]
	"success": { "hacker_cred": 1, +$4K/(play}bag_of_tricks(hand}, "+1 Hacker Cred and your choice: $4K bonus, or play any one Bag of Tricks card from your hand free of cost."}
	"failure": { "hacker_cred": 2,"-2 Hacker Cred."}
}



/*23*/
{
	"newb_mission": false,
	"mission_title": "Wired"
	"mission_desc": "You’re moonlighting as an electrician for your local artisan coffee shop."
	"tasks": [(barista,"mod": 0,"They let you have free run of their top-of-the-line espresso machine while you’re there. Unfortunately, you can’t concentrate on the job until you make the perfect cappuccino.. with foam art of a T.rex."}, { "skill": "hardware_hacking", "mod": 0, "Rewire those lights!"}]
	"success": { "hacker_cred": 1, (1 roll}barista/forensics, "+1 Hacker Cred. You may put this card in your hand and treat it as an Entropy card that gives an automatic success on any barista or forensics roll; discard after use."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred. You’re not going to sleep until sometime next year."}
}


/*24*/
{
	"newb_mission": false,
	"mission_title": "e-Theft Auto"
	"mission_desc": "Bent coat hangers are go last year. The computers in today’s cars are supposed to kill the engine if the real key isn’t in use; local police would like you to demo the system’s fallibility."
	"tasks": [{ "skill": "network_ninja",-2,"Cars: 100 internal computers and counting! Connect your laptop to the car’s internal network and intercept the chatter."}, { "skill": "cryptanalysis", "mod": 0, "Bypass the car’s cryptographic anti-theft features."}, { "skill": "hardware_hacking","mod": 0, "[You may skip this roll] For a more impressive demo, package the entire attack into a little hardware doodad."}
	"success": { "hacker_cred": 1/hacker_cred+2{ "skill": "hardware_hacking" roll}," +1 Hacker Cred or +2 if you made the hardware_hacking roll."}
	"failure": { "hacker_cred": 2,"-2 Hacker Cred."}
}



/*25*/
{
	"newb_mission": false,
	"mission_title": "That’s What She Said"
	"mission_desc": "You don’t always want to share your conversations with the world; experiment with a new security scheme for cellular phone calls."
	"tasks": [{ "skill": "web_procurement","mod": 0,"Get a bunch of cheap handsets for your experiments."}, { "skill": "hardware_hacking" OR connections, "mod": 0, "Cobble together some hardware to act as a cell phone base station or borrow the real thing from a friend."}, (CRYPTANALAYSIS,"mod": 0, "Design and implement your new encryption scheme."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred. Your new cellular protocol is great - now there’s one more secure option that companies can decide not to use."}
	"failure": { "hacker_cred": 1, bag_of_tricks-1, "-1 Hacker Cred. Discard one Bag of Tricks card that you have in play."}
}



/*26*/
{
	"newb_mission": false,
	"mission_title": "I’d Tap That"
	"mission_desc": "The client wants you to audit LightningTap: their new contactless credit card payment system."
	"tasks": [{ "skill": "cryptanalysis","mod": 0,"Find a vulnerability in their crypto implementation that allows you to manufacture cloned cards."}, { "skill": "social_engineering", "mod": 0, "Demonstrate the vulnerability by making a purchase - with permission - in an actual store. Act natural."}, { "skill": "forensics", "mod": 0, "Recommend some new logging techniques that would help detect fraudulent purchases."}]
	"success": { "hacker_cred": 1, (play}bag_of_tricks(hand/discard}, "+1 Hacker Cred. Choose one Bag of Tricks card form your hand or the discards; you can play the item free of charge."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*27*/
{
	"newb_mission": false,
	"mission_title": "I Hack You a Latte"
	"mission_desc": "You’re switching it up for this company audit. Tell the front desk that you’re opening a new cafe and want to set up a promotional coffee cart in their lobby."
	"tasks": [(connections OR web_procurement,"mod": 0,"Of course, you need actual coffee cart equipment to pull this off."}, (barista, "mod": 0, "12oz, non-flat, split-shot, extra-hot, 3 pump mocha with whip. Can you keep all the orders straight?"}, { "skill": "network_ninja", "mod": -1, "Plug into their internal wired network when nobody’s looking and pwn them."}]
	"success": { "hacker_cred": 1, (play}bag_of_tricks(hand/discard}, "+1 Hacker Cred. Choose one Bag of Tricks card from your hand or the discards; you can play the item free of charge."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*28*/
{
	"newb_mission": false,
	"mission_title": "8-Bit Birthday"
	"mission_desc": "Ah, green and black asteroid shooters, sidescrollers, and lo-fi music… your friend’s birthday is coming up, and you want to surprise her with some nostalgia-inducing old-time video games."
	"tasks": [{ "skill":"software_wizardry" OR web_procurement,"mod": 0,"Write some emulation software so that she can play the games on her current computer.. or just find a vintage console online."}, { "skill": "social_engineering","mod": 0, "Get her out of her house on a bogus errand so you can smuggle in the birthday cake."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*29*/
{
	"newb_mission": false,
	"mission_title": "LEEROOOOOOOY!!"
	"mission_desc": "Audit the login process of a new massively-multiplayer online game."
	"tasks": [{ "skill": "hardware_hacking",+1,"Is their hardware authenticator dongle secure?"}, { "skill": "cryptanalysis", "mod": 0, "Does the login process use an appropriate encryption algorithm given their hardware constraints?"}, { "skill": "network_ninja", "mod": 0, "And is that algorithm properly implemented?"}]
	"success": { "hacker_cred": 1, entropy_card+1, "+1 Hacker Cred. The grateful company gives you and three of your friends lifetime accounts. Draw an Entropy Card."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}

/*30*/
{
	"newb_mission": false,
	"mission_title": "A Rash Decision"
	"mission_desc": "Your local hospital wants to release medical records for research - anonymized, for your protection! - but you have a sneaking suspicion that removing names and addresses won’t be enough."
	"tasks": [{ "skill": "search_fu","mod": 0,"Voter registration databases, marriage records, legal proceedings - a lot of information is publicly available… if you know where to look."}, { "skill":"software_wizardry", "mod": -1, "Cross-correlate demographic information from multiple databases and match anonymous medical records to actual people. Turns out that someone on the city council has quite the embarrassing rash."}]
	"success": { "hacker_cred": 1, mission_card+1, "+1 Hacker Cred. Next round, draw an extra Mission card; you may take both to the Staff Video Conference before you decide which to play (and discard the other}."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*31*/
{
	"newb_mission": false,
	"mission_title": "My Little Pwnie"
	"mission_desc": "It’s the Wild Wild Web annual white hat hacker competition, and the first one to claim the plastic pony out of a locked box (in a locked room} wins the prize."
	"tasks": [{ "skill": "hardware_hacking","mod": 0,"Hack together a device that will bypass the security card reader on the hotel door."}, (LOCK PICKING, "mod": 0, "Pick that lockbox!"}]
	"success": { "hacker_cred": 1, (play}bag_of_tricks_reroll_4(hand/discard}, "+1 Hacker Cred. If you have the Bag of Tricks: Magic Lessons card in your hand, or if it is in the discard pile, you can play it free of charge."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*32*/
{
	"newb_mission": false,
	"mission_title": "Om Nom Credit Cards"
	"mission_desc": "The sushi here is delicious. The security, not so much. A group of organized criminals has been stealing credit card numbers from the restaurant for months. Who are they, and how did they do it?"
	"tasks": [{ "skill":"software_wizardry","mod": 0,"There’s malware installed on the point of sale machine. Can you find it?"}, { "skill": "network_ninja", "mod": -1, "Monitor the restaurant’s network traffic and find out where the criminals are sending the credit card numbers."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred."}
	"failure": { "hacker_cred": 1, -$1K, "-1 Hacker Cred and lose $1K."}
}




/*33*/
{
	"newb_mission": false,
	"mission_title": "Shock Value"
	"mission_desc": "Is the Pacific Northwest’s power grid secure?"
	"tasks": [{ "skill": "social_engineering", "mod": -2,"Call the IT desk (I’m a new employee!} and con them into giving you the IP (Internet} address of one of their servers."}, { "skill": "network_ninja", "mod": 0, " Their computers can’t be taken down for the standard software update procedures - and that means that you can exploit code that everyone else patched in 1999."}]
	"success": { "hacker_cred": 2,"+2 Hacker Cred. The managers are shocked; you aren’t."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}


/*34*/
{
	"newb_mission": false,
	"mission_title": "One Hacker, Won Vote"
	"mission_desc": "The audit target: an electronic voting machine rushed to market in time for an election."
	"tasks": [{ "skill": "lockpicking" OR web_procurement,"mod": 0,"Pick the lock or locate a site that sells the manufacturer’s master key. Now you have access to the system internals - including the software."}, { "skill":"software_wizardry", "mod": 0, "Use your reverse engineering skills to discover ways to undetectably change votes."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred. You could pull this attack off in two minutes in a voting booth."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}

/*35*/
{
	"newb_mission": false,
	"mission_title": "Lights, Camera, Hack!"
	"mission_desc": "You’ve been hired to consult on a new cyberthriller movie."
	"tasks": [{ "skill": "cryptanalysis","mod": 0,"Look through the script for blatant inaccuracies."}, { "skill": "social_engineering", +3, "Can you convince the producers that hacking doesn’t actually look like a speed-typing race?"}]
	"success": { "hacker_cred": 1,"You don’t know that many hackers that code in leather bodysuits or designer sunglasses, but no one in your office is complaining. +1 Hacker Cred."}
	"failure": { "hacker_cred": 3,"You’ve already told everyone about consulting on the movie, so its inaccuracies are triply embarrassing. -3 Hacker Cred."}
}



/*36*/
{
	"newb_mission": false,
	"mission_title": "[CENSORED]"
	"mission_desc": "The U.S. State Department sponsors a competition to help people in other countries access the web without restriction."
	"tasks": [{ "skill": "network_ninja","mod": 0,"Design a protocol to help circumvent Internet censorship. Why shouldn’t people be able to read or write political blogs?"}, { "skill":"software_wizardry", "mod": 0,"Write easy-to-use software implementing your protocol."}, { "skill": "cryptanalysis", "mod": 0,"Steganography is like cryptography, right? Can you prevent an opponent from even figuring out when someone is using your software?"}]
	"success": { "hacker_cred": 2,"It’s a cat-and-mouse game, but this round is yours. +2 Hacker Cred and draw an Entropy card."}
	"failure": { "hacker_cred": 1, entropy_card-2, "Discard 2 Entropy cards from your hand. -1 Hacker Cred."}
}



/*37*/
{
	"newb_mission": false,
	"mission_title": "Going All The Way"
	"mission_desc": "Your client won’t believe that software vulnerabilities are relevant until you turn them into fully weaponized exploits."
	"tasks": [{ "skill":"software_wizardry","mod": 0,"First step: locate several potential vulnerabilities in their code."}, { "skill":"software_wizardry", "mod": -1, "Next step: experiment with exploits until you find one that works."}, { "skill":"software_wizardry", "mod": -2, "Final step: weaponize. Victims visit your web page, their computers get infected, and you gain total control. Give a limited demonstration."}]
	"success": { "hacker_cred": 2,"+2 Hacker Cred."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*38*/
{
	"newb_mission": false,
	"mission_title": "A Riddle, Wrapped in a Mystery"
	"mission_desc": "The North Ocean Parkway Museum wants to add an exhibit about the impact computer science had on the outcome of World War II, and the curator asks for your help."
	"tasks": [{ "skill": "web_procurement","mod": 0,"Get your hands on a working Enigma cipher machine."}, { "skill": "cryptanalysis", "mod": 0, "Prepare some text for the N.O.P. exhibit that describes Allied code-breaking efforts. Understandable’s the word!"}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}


/*39*/
{
	"newb_mission": false,
	"mission_title": "Trojan Protection"
	"mission_desc": "Supertonics - a U.S. Department of Defense supplier - wants to verify that no extra features are added to its hardware during the overseas manufacturing process… features like letting attackers in via an electronic backdoor."
	"tasks": [{ "skill": "social_engineering", "mod": -3,"Interview factory workers and study the manufacturing pipeline to figure out where it could be sabotaged. (You’re working through a translator, which makes the job harder than usual."}, { "skill": "hardware_hacking", +1, "Help Supertronics spot check manufactured circuit boards for any electronic Trojan Horses.]
	"success": { "hacker_cred": 1, entropy_card+1, "+1 Hacker Cred and draw an Entropy card."}
	"failure": { "hacker_cred": 2,"-2 Hacker Cred"}
}



/*40*/
{
	"newb_mission": false,
	"mission_title": "eTextiles"
	"mission_desc": "A friend wants to create a centrepiece for his fashion show: a dress covered in LEDs that change colors according to ambient noise. Help him out."
	"tasks": [{ "skill": "hardware_hacking", "mod": -1,"Grab some LEDs, some conductive thread, and a thimble. Make it work!"}, { "skill": "search_fu", "mod": 0, "The thread keeps fraying. Look online to see if anyone has a technique to avoid the problem."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*41*/
{
	"newb_mission": false,
	"mission_title": "Mr. Botneto"
	"mission_desc": "It’s a never-ending job trying to figure out the botmasters’ last tricks."
	"tasks": [{ "skill": "network_ninja","mod": 0,"Analyze heaps of internet traffic to get an idea of the botnet’s size (a million infected computers} and growth rate (freaky fast!}."}, (barista, "mod": 0, "More coffee? Are you from Seattle or something?"}, { "skill": "cryptanalysis", "mod": 0, "Reverse engineer the command-and-control algorithm. You can cripple the bonnet if you can figure out where the next commands will come from.]
	"success": { "hacker_cred": 2,"+2 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}


/*42*/
{
	"newb_mission": false,
	"mission_title": "E. coli Cryptography"
	"mission_desc": "Alternative fuels, disaster cleanup, data storage… plus, glow-in-the-dark bacteria! the possibilities of synthetic biology on a project."
	"tasks": [(connections,"mod": 0,"Get someone with the right equipment and biology know-how to collaborate on a project."}, { "skill": "cryptanalysis","mod": 0,"Develop a crypto algorithm that can run on a colony of modified bacteria. Restriction enzymes, here we come!"}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred, and you feel like a mad scientist. In a goo way."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*43*/
{
	"newb_mission": false,
	"mission_title": "Dog’s Best Friend"
	"mission_desc": "Your pet loves a friendly game of chase. Luckily, you happen to have a robotic vacuum cleaner, and you’ve been wanting to give it some mods."
	"tasks": [{ "skill": "hardware_hacking","mod": 0,"Do some rewiring to give your robot friend some webcam eyes."}, { "skill":"software_wizardry", "mod": -1, "With a bit of coding magic, the robot can keep your pet entertained for hours."}]
	"success": { "hacker_cred": 2,"+2 Hacker Cred"}
	"failure": { "hacker_cred": 2,"-2 Hacker Cred"}
}



/*44*/
{
	"newb_mission": false,
	"mission_title": "Impressionable Minds"
	"mission_desc": "Liven up your next night babysitting by demonstrating your l33t hacker skillz."
	"tasks": [{ "skill": "lockpicking" OR network_ninja, -3,"Show off your lockpicking know-how. Alternatively, hack theirWi-Fi traffic and dazzle them by swapping all their image search results with pictures of kittens."}]
	"success": { "hacker_cred": ,"+1 Hacker Cred"}
	"failure": { "hacker_cred": , (next round}entropy_card+0, "-1 Hacker Cred. Well, that was embarrassing. And the company charges how much for your services? Draw no Entropy card at the start of the next round."}
}



/*45*/
{
	"newb_mission": false,
	"mission_title": "30 Minutes or Your Next Audit’s Free"
	"mission_desc": "Johnson, Johnson, johnson, and Johnson - the local premier law firm - has hired you for audit."
	"tasks": [{ "skill": "social_engineering" OR network_ninja, -1,"Talk your way past the front desk (I’ have to deliver this pizza!} or distract the assistant by flooding his phone line with automated calls."}, (LOCK PICKING, -1,"1 drill + 5 minutes = 1 cracked safe. Guess they need a better safe."}]
	"success": { "hacker_cred": 1, "cash": 2000, "+1 Hacker Cred and get $2K."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*46*/
{
	"newb_mission": false,
	"mission_title": "You Don’t Know Where That’s Been!"
	"mission_desc": "Your client, C.A.T. Enterprises, doesn’t believe that this social_engineering thing works in real life."
	"tasks": [{ "skill":"software_wizardry",-2,"Write some malware that covertly uploads confidential financial reports to your server."}, { "skill": "social_engineering", "mod": 0, "Drop infected USB thumb drives around their parking lot labeled "if found please return" and "sexy party photos.""}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred. Apparently, curiosity does kill the C.A.T."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred."}
}



/*47*/
{
	"newb_mission": false,
	"mission_title": "He’s Looking at You, Kid"
	"mission_desc": "A webcam-equipped Wi-Fi robot in the kids’ aisle? Imaging, being able to control your toy robot from a friend’s house. You’re a super spy!. Time for a pro bono security audit."
	"tasks": [{ "skill": "network_ninja","mod": 0,"I find your lack of encryption disturbing"}, { "skill": "forensics", "mod": -1, "Modify their loggin procedures so that they record enough information to detect anomalous logins."}]
	"success": { "hacker_cred": 1,"No Encryption means that anyone can intercept and watch the toy’s video stream. notify the vendor. +1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*48*/
{
	"newb_mission": false,
	"mission_title": "Network Triage"
	"mission_desc": "White hallways, fluorescent lights, and the smell of disinfectants… the local hospital It staff hires you for an audit."
	"tasks": [{ "skill": "network_ninja","mod": 0,"Analyze network traffic for suspicious activity."}, { "skill": "search_fu", "mod": 0,"This pattern of network activity is tickling something in your memory… what was it again?"}]
	"success": { "hacker_cred": 1,"Now you remember - this looks like a virus that was making the rounds five years ago. The hospital’s infected MRI machine runs an unmatched operating system no one was targeting it, but even random crashes can be serious bad news. +1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*49*/
{
	"newb_mission": false,
	"mission_title": "Mix and Mingle"
	"mission_desc": "You host a Hacker Happy Hour at your house and invite local notables in the hacker community."
	"tasks": [(barista,"mod": 0,"You mix a mean espresso martini, but you’ve never had to serve this many people at once."}, { "skill": "social_engineering", "mod": 0, "Make like hot air in a convection oven and circulate."}]
	"success": { "hacker_cred": 1,"party_success++; +1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*50*/
{
	"newb_mission": false,
	"mission_title": "Security du Jour"
	"mission_desc": "Technology standards may not ensure top quality, but hats off to them of raising the bar. Provide feedback on a new proposal for international data security standards."
	"tasks": [{ "skill": "cryptanalysis","mod": 0,"Make sure that the proposed protocol is secure. There’s no such thing as an ‘A’ for effort when it comes to security."}, { "skill": "social_engineering", "mod": 0, "Draft a cogent and compelling argument for your suggest improvements."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*51*/
{
	"newb_mission": false,
	"mission_title": "Cameras and Ovens and Cars, Oh My!"
	"mission_desc": "You agree to teach a series of night classes on security for embedded electronic systems."
	"tasks": [{ "skill": "search_fu","mod": 0,"Search online for course materials form other instructors. If you fail this roll, you may continue, but all other rolls during the Mission are at -2."}, { "skill": "hardware_hacking","mod": 0,"Write up some lovely, lucid lectures."}, { "skill":"software_wizardry", "mod": 0, "Time to design a course project!"}]
	"success": { "hacker_cred": 1, "cash": 2000, "+1 Hacker Cred an receive $2K in compensation"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*52*/
{
	"newb_mission": false,
	"mission_title": "Minibar, Mini Bill"
	"mission_desc": "The hotel put RFID product tags on all the minibar items. In your jet-lagged state, you get up to some sleep-hacking."
	"tasks": [{ "skill": "hardware_hacking", "mod": -2,"Make (and plant} counterfeit RFID tags so that the minibar thinks that all the items are still there."}, { "skill": "social_engineering", +1, "Be sure to break it gently to the hotel management when you settle the bill."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*53*/
{
	"newb_mission": false,
	"mission_title": "Hands in the Air!"
	"mission_desc": "Your audit target is Cheerfully Helpful Credit Union - We take your money with a smile."
	"tasks": [{ "skill": "social_engineering","mod": 0,"Buy uniform coveralls, print a fake badge, then stop by the bank to service their telephone system."}, { "skill":"software_wizardry", "mod": 0, "Install a program that will periodically send copies of users’ passwords to the bank’s CTO."}]
	"success": { "hacker_cred": 1,"+1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}



/*54*/
{
	"newb_mission": false,
	"mission_title": "The Future Is Now"
	"mission_desc": "You’re consulting for Neurogenesis, a company developing a next-generation neural implant to restore long-term memory functioning to patients with hippocampal damage."
	"tasks": [{ "skill": "hardware_hacking","mod": 0,"Familiarize yourself with the implant’s specs"}, { "skill": "cryptanalysis","mod": 0, "Select a cryptographic scheme that should withstand cryptanalysis advances for 50 years."}, { "skill": "network_ninja", "mod": 0, "Implement a network protocol that will allow the neurologist to (securely!} wirelessly check up on the implant."}]
	"success": { "hacker_cred": 1, "cash": 2000, "+1 Hacker Cred and receive $2K."}
	"failure": { "hacker_cred": 1,"-1 Hacker Cred"}
}


/*55*/
{
	"newb_mission": false,
	"mission_title": "Blind Trust"
	"mission_desc": "Sometimes you think people will install any phone app, no matter where it comes form. Time for an experiment."
	"tasks": [{ "skill":"software_wizardry","mod": 0,"Write a game that secretly takes a photo every 30 minutes. (As a white hat, you play nice, so don’t upload them!}"}, { "skill": "social_engineering", "mod": 0, "What would make your game popular? Pigs? Birds? Kittens? Chainsaws?"}]
	"success": { "hacker_cred": 1,"They may have trusted you, but your app isn’t so blind. Some of those photos could be really,um, interesting. +1 Hacker Cred"}
	"failure": { "hacker_cred": 1,"You released a Trojan app - What were you thinking? -1 Hacker Cred"}
}
{
	"newb_mission": false,
	"mission_title": "Magstripe Mischief",
	"mission_desc": "The local TV station wants to do a story on credit card skimming. Astound them with a sexy demo.",
	"tasks": [
		{
			"skill": "hardware_hacking",
			"mod": 0,
			"alt": null,
			"desc": "3D printers are getting cheaper, and criminals can be clever. Use your office 3D printer to fabricate a credit card skimmer for a gas station pump."}, { "skill": "social_engineering", "mod": 0, "Now you’re ready to copy some magstripes! Smile for the camera and use Sleight of hand to discreetly install a test skimmer at a gas station."
		}
	],
	"success": { "hacker_cred": 1 }
	"failure": { "hacker_cred": 1 }
}
































